{
  "agent": "An **Agent** is any entity capable of sensing and responding to its environment. It may be biological (e.g., a person, whale, or tree), technical (e.g., a computing process), or social (e.g., a family, cooperative, or commons). - Every Agent has a unique identity and a corresponding [I-Space](#i-space) — a private AgentSpace that houses its [LifeCode](#lifecode), [Data Grove](#data-grove), and core affordances. - Agents can make [offers](#offer) and accept _offers_ made by others to form [Agreements](#agreement). Agents are expressed as [Holons](#holon) that belong to one or more [AgentSpaces](#agentspace). Every Agent belongs to the [Exosphere](#exosphere) and typically one or more additional _AgentSpaces_.",
  "agentspace": "An **AgentSpace** is a membrane-bound social space where [Agents](#agent) interact, co-create, and participate in regenerative value flows. It is simultaneously: - A [HolonSpace](#holonspace) — stewarding both Agents and [Holons](#holon) - A **container** for knowledge, relationships, and shared governance - A venue for [Offers](#offer), [Agreements](#agreement), [Promises](#promise), and visualization Every AgentSpace has its own [LifeCode](#lifecode), and every interaction between Agents happens **within** an AgentSpace. ⚠️ *Not every AgentSpace is itself an Agent (i.e., not all are [Social Organisms](#social-organism)), but some  AgentSpaces, once sufficiently coherent and governed, may themselves become Agents — emergent wholes acting at a higher level of the holarchy.*",
  "agreement": "An **Agreement** is a structured bundle of [Promises](#promise) between [Agents](#agent). It includes mutual commitments, often encoded as [Offers](#offer) and formalized via digital signature. An Agreement may instantiate its own **AgentSpace** (an Agreement-Based AgentSpace) which becomes the interaction venue for activities governed by that agreement.",
  "agreement-based-agentspace": "An **Agreement-Based AgentSpace** is a bounded interaction context that emerges when an [Offer](#offer) is accepted and an [Agreement](#agreement) is formed. It includes: - All participating [Agents](#agent) - A [LifeCode](#lifecode) derived from the shared promises and intent of the Agreement - A scoped [Data Grove](#data-grove) of relevant Holons and references - The governance and coordination logic encoded in the Agreement, including optional roles for verification, mediation, or escalation While agreements may **expire**, be **revoked**, or become **inactive**, the AgentSpace itself — like all entities in the MAP — is **immutable and persistent**. Its history, structure, and prior interactions remain verifiable and accessible, preserving both accountability and lineage. > An Agreement-Based AgentSpace is the **sovereign membrane** where promises take form, interactions unfold, and trust-based coordination becomes possible — with a cryptographically assured memory.",
  "dahn-dynamic-adaptive-holon-navigator": "A personalized, dynamic interface layer for exploring the MAP holon graph. DAHN empowers each agent to shape their own experience — not just by choosing settings, but by composing the very way information is seen, explored, and interacted with. Rather than each app imposing its own interface, DAHN provides a **coherent visual and interaction layer across all Mapps**. This coherence is achieved through dynamic selection of visualizers — modular components contributed by HX designers to the federated [Visualizer Commons](#visualizer-commons). DAHN embodies the MAP design philosophy: **putting agents at the center of their digital experience**, enabling expressive, adaptable, and trustable interfaces that evolve with collective and individual needs."
}